# =============================================================================
# Brewfile.pentest — Configuration pentest & sécurité offensive
# =============================================================================
# ⚠️  À installer EN COMPLÉMENT du profil normal (Brewfile)
# ⚠️  Ces outils sont destinés à un usage légal uniquement :
#     audits autorisés, CTF, bug bounty, lab personnel
#
# Prérequis :
#   brew bundle   ← installe d'abord le profil normal
#
# Installation :
#   brew bundle --file=Brewfile.pentest
# =============================================================================

tap "sidaf/pentest"
tap "wpscanteam/tap"

# ─── Réseau & scan ────────────────────────────────────────────────────────────
brew "aircrack-ng"  # Suite d'audit réseau Wi-Fi (WEP/WPA crack, injection)
brew "arp-scan"     # Scanner ARP et fingerprinting réseau local
brew "netcat"       # Couteau suisse TCP/UDP (écoute, transfert, tunnels)
brew "nmap"         # Scanner de ports et détection de services/OS
brew "openvpn"      # Client/serveur VPN SSL/TLS (pivoting, tunnels)
brew "wireshark"    # Analyseur de protocoles réseau (CLI : tshark)

# ─── Reconnaissance & OSINT web ───────────────────────────────────────────────
brew "feroxbuster"  # Découverte de contenu web (fuzzing récursif, Rust)
brew "ffuf"         # Fuzzer web rapide (répertoires, paramètres, vhosts)
brew "gobuster"     # Brute-force DNS/répertoires/vhosts écrit en Go
brew "httrack"      # Copie de sites web pour analyse offline
brew "nikto"        # Scanner de vulnérabilités de serveurs web
brew "sqlmap"       # Détection et exploitation automatique d'injections SQL

# ─── Exploitation & post-exploitation ─────────────────────────────────────────
brew "exploitdb"    # Base de données locale Exploit-DB (searchsploit)
brew "hydra"        # Cracker de mots de passe réseau (SSH, FTP, HTTP, SMB…)
brew "john"         # John the Ripper — casseur de hashes multi-formats
brew "hashcat"      # Casseur de hashes GPU (le plus rapide du marché)
brew "yara"         # Identification et classification de malwares par règles

# ─── Découverte réseau avancée (tap sidaf/pentest) ────────────────────────────
brew "sidaf/pentest/netdiscover"  # Découverte active/passive d'hôtes réseau
brew "sidaf/pentest/ridenum"      # Énumération RID/utilisateurs Windows via SMB
brew "sidaf/pentest/snmpcheck"    # Énumération SNMP (community strings, infos système)

# ─── CMS & applications web ───────────────────────────────────────────────────
brew "wpscanteam/tap/wpscan"      # Scanner de vulnérabilités WordPress

# ─── Apps GUI — Pentest ───────────────────────────────────────────────────────
cask "burp-suite"    # Proxy d'interception web et suite de test (PortSwigger)
cask "qflipper"      # Companion app pour Flipper Zero (badge RFID, IR, radio)
cask "wireshark-app" # Interface graphique Wireshark
