tap "hashicorp/tap"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "pulumi/tap"
tap "sidaf/pentest"
tap "wpscanteam/tap"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Database of public exploits and corresponding vulnerable software
brew "exploitdb"
# Modern, maintained replacement for ls
brew "eza"
# Fast, simple, recursive content discovery tool written in Rust
brew "feroxbuster"
# Fast web fuzzer written in Go
brew "ffuf"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Website copier/offline browser
brew "httrack"
# Configurable static site generator
brew "hugo"
# Network logon cracker which supports many services
brew "hydra"
# Featureful UNIX password cracker
brew "john"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Mac App Store command-line interface
brew "mas"
# Utility for managing network connections
brew "netcat"
# Web server scanner
brew "nikto"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Easiest way to use Git. On any platform. Anywhere
brew "ungit"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# Malware identification and classification tool
brew "yara"
# Terraform
brew "hashicorp/tap/terraform"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
brew "sidaf/pentest/netdiscover"
brew "sidaf/pentest/ridenum"
brew "sidaf/pentest/snmpcheck"
# Black box WordPress vulnerability scanner
brew "wpscanteam/tap/wpscan"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Cryptocurrency exchange
cask "binance"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
# Web browser
cask "firefox"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Hex editor focussing on speed
cask "hex-fiend"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source Markdown editor
cask "macdown"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Email client integrated with Notion workspace
cask "notion-mail"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Companion app for Flipper Zero devices
cask "qflipper"
# Screen recorder
cask "tella"
# LaTeX editor
cask "texmaker"
# Unpacks archive files
cask "the-unarchiver"
# Virtual machines UI using QEMU
cask "utm"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Gives Vagrant VMware plugin access to various VMware functionalities
cask "vagrant-vmware-utility"
# Virtualiser for arm64 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Connect to Windows
cask "windows-app"
# Network protocol analyzer
cask "wireshark-app"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "CmdRef", id: 956853496
mas "CopyClip", id: 595191960
mas "Data Jar", id: 1453273600
mas "Developer", id: 640199958
mas "Hand Mirror", id: 1502839586
mas "HotKey", id: 975890633
mas "Jayson", id: 1468691718
mas "Kindle", id: 302584613
mas "Lekh", id: 576124115
mas "OX Drive", id: 818195014
mas "Quick Note", id: 1472935217
mas "Stockfish", id: 801463932
mas "SysNetInfo", id: 1118988797
mas "Tidy Mind", id: 1526174269
mas "Xcode", id: 497799835
vscode "10nates.ollama-autocoder"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "alexcvzz.vscode-sqlite"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antstack.aws-js-code-snippet"
vscode "austenc.tailwind-docs"
vscode "azurepaas-tools.vscode-learncloud"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-yaml-preamble"
vscode "binarybytes.snippets"
vscode "boto3typed.boto3-ide"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codium.codium"
vscode "congnguyendinh0.aws-amplify-flutter-snippet"
vscode "corernd.wai-vscode"
vscode "ctc.vscode-tree-extension"
vscode "cungen.markdown-slide"
vscode "dalirnet.rtl-markdown"
vscode "danielsanmedium.dscodegpt"
vscode "dannysteenman.cloudformation-yaml-snippets"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "eliostruyf.vscode-front-matter"
vscode "eridem.vscode-postman"
vscode "esbenp.prettier-vscode"
vscode "fallenmax.mithril-emmet"
vscode "fantasy.markdown-all-in-one-for-web"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "foam.foam-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "gera2ld.markmap-vscode"
vscode "gitbook.gitbook-vscode"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gluestack.gluestack-vscode"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gsgupta.opencv-snippets"
vscode "hall.draw"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "henriquebruno.github-repository-manager"
vscode "herrlax.ts-interface-from-class"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "humao.rest-client"
vscode "igorsbitnev.error-gutters"
vscode "infeng.vscode-react-typescript"
vscode "itayadler.terraform-ssm"
vscode "jabrythehutt.awsrd"
vscode "jacobdufault.fuzzy-search"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "john-goldsmith.vscode-aws-cloudformation-auto-template-generator"
vscode "johnguo.simply-view-image-for-python-opencv-debugging"
vscode "johnpapa.vscode-peacock"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-codemetrics"
vscode "loganarnett.lambda-snippets"
vscode "mark-tucker.aws-cli-configure"
vscode "marp-team.marp-vscode"
vscode "mattpocock.ts-error-translator"
vscode "mhutchie.git-graph"
vscode "mike-co.import-sorter"
vscode "monish.regexsnippets"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vscode.vscode-typescript-next"
vscode "mziyabo.vscode-codedeploy"
vscode "necatiarslan.aws-access-vscode-extension"
vscode "necatiarslan.aws-s3-vscode-extension"
vscode "njpwerner.autodocstring"
vscode "node-projects.vscode-designer-addon"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "okteto.remote-kubernetes"
vscode "oouo-diogo-perdigao.docthis"
vscode "orta.vscode-jest"
vscode "p1c2u.docker-compose"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "pomdtr.excalidraw-editor"
vscode "pomdtr.markdown-kroki"
vscode "postman.postman-for-vscode"
vscode "poyashad.display-aws-amplify-environment"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "qwtel.sqlite-viewer"
vscode "rafaelrodrigues.convertto-ssm"
vscode "rafwilinski.dynamodb-vscode-snippets"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "sameeramin.cdk-snippets-for-python"
vscode "searking.preview-vscode"
vscode "sgryt.typescript-pack"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shibu.nextjs-js-ts-code-snippets"
vscode "shinotatwu-ds.file-tree-generator"
vscode "sonarsource.sonarlint-vscode"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "suhelmakkad.shadcn-ui"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "tchayen.markdown-links"
vscode "techiecouch.docker-essentials"
vscode "technovangelist.ollamamodelfile"
vscode "teetangh.aws-essentials"
vscode "tomoki1207.pdf"
vscode "tonybaloney.vscode-pets"
vscode "toramameseven.markdown-docx"
vscode "twxs.cmake"
vscode "tyriar.lorem-ipsum"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "voorjaar.windicss-intellisense"
vscode "vscode-aws-console.vscode-aws-console"
vscode "vscode-extensions-farshid.vscode-extensions-farshid"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gitdoc"
vscode "vue.volar"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wattenberger.footsteps"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "xuangeaha.vsmarketplace-badges"
vscode "yamlhunter.yamltemplatemaker"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zhang-renyang.chat-gpt"
vscode "zhaouv.vscode-markdown-draw"
